<template>
  <div class="maincontainer">
    <!-- <el-container>
		  <el-aside style="height: 50vh;" width="200px" ><Sidebar></Sidebar></el-aside>
		  <el-main>Main</el-main>
		</el-container> -->
    <el-row :gutter="20" class="el-row">
      <el-col :span="4"><Sidebar></Sidebar></el-col>
      <el-col :span="20"> 通知公告 </el-col>
      <el-col :span="20">
        <el-button type="success" @click="handleAdd">添加通知</el-button>
      </el-col>
      <el-col :span="20">
        <el-table :data="noticeDate" style="width: 100%">
          <el-table-column label="id" width="180">
            <template slot-scope="scope">
              <span style="margin-left: 10px">{{ scope.row.id }}</span>
            </template>
          </el-table-column>
          <el-table-column label="标题" width="180">
            <template slot-scope="scope">
              <p>
                <b>{{ scope.row.title }}</b>
              </p>
            </template>
          </el-table-column>
          <el-table-column label="描述" width="680">
            <template slot-scope="scope">
              <span style="margin-left: 10px">{{ scope.row.description }}</span>
            </template>
          </el-table-column>
          <el-table-column label="上传日期" width="180">
            <template slot-scope="scope">
              <i class="el-icon-time"></i>
              <span style="margin-left: 10px">{{ scope.row.update_time }}</span>
            </template>
          </el-table-column>
          <el-table-column label="操作">
            <template slot-scope="scope">
              <el-button
                size="mini"
                @click="handleDetail(scope.$index, scope.row)"
                >查看</el-button
              >
              <el-dialog title="查看通知" :visible.sync="dialogTableVisible">
                  <el-input
                    type="textarea"
                    :autosize="{ minRows: 5, maxRows: 30 }"
                    v-model="nowContent"
                  >
                  </el-input>
              </el-dialog>
              <el-button
                size="mini"
                @click="handleEdit(scope.$index, scope.row)"
                >编辑</el-button
              >
              <el-button
                size="mini"
                type="danger"
                @click="handleDelete(scope.$index, scope.row)"
                >删除</el-button
              >
            </template>
          </el-table-column>
        </el-table>
      </el-col>
    </el-row>
  </div>
</template>

<script>
import Sidebar from "../../components/Sidebar.vue";
export default {
  components: {
    Sidebar,
  },
  data() {
    return {
      dialogTableVisible: false,
      nowContent:'',
      noticeNum: 0,
      noticeDate: [
        {
          id: 1,
          title: "法法师阿发 按时发生 ",
          description:
            "法发顺丰啊沙发沙发上大发顺丰啊发顺丰按时发顺丰安抚安抚安抚萨沙发阿发十三分芬安抚撒发 ",
          update_time: " 2021-05-08",
          content: `“文章”的“章”字，是个会意字，从音从十。古代奏音乐，连奏十段才能结束（十，数之终也），这十段乐就是一章。所以，文章文章，也有段落。文章既从“音乐”里会意出来，应是用文字表达出来的东西，读起来如音乐一样美妙无穷、悦耳动听的文字，传诵开来，才配得上“文章”一词的真正含义。
释义
“文”即“纹”，指“纹路”、“纹样”。“章”本指“屏蔽”，转指“外表”。“文章”原义指“有纹样的表面”，诸如服装上绣绘的龙凤图样、皮肤上针刺的花卉图案，等等。即其原义是指直接构成视觉形象的图样。后指文字所描绘出来的事物图样，需要大脑“解码”才能完整呈现的间接的事物形象。
柳宗元的画像
柳宗元的画像
⑴原指文辞，现从写作的角度与“文学”区分，指篇幅不很长而独立成篇的文字。
西汉·司马迁《史记·儒林列传》：“文章尔雅，训词深厚。”你看了晨报上的那篇文章了么？
清田兰芳《明河南参政袁公墓志铭》：“公（袁可立子袁枢）实出于潘母。美仪观，多大略。年十二入州庠，见赏於督学何公应瑞，文章有声场屋间。”
⑵[Literary works;Writings]：泛指著作
为文章。——唐·柳宗元《柳河东集》
每为文章。
⑶比喻曲折隐蔽的含义
要素
文章的基本要素——主题、材料、结构、语言，是文章学的主要研究对象，以往各种写作论著论之甚详，但对其概念内涵的揭示似欠斟酌，定义并不严格。新近出版的写作论著，或沿用旧说，或虽有改动而仍值得商榷。本文拟从严格意义上的定义要求出发，结合有关知识，对这四个要素概念的种种“定义”质疑问难，并试提出自己的修正意见，以就教于写作界同行。
主题
最常见的定义是：“主题是文章中通过具体材料所表达的基本思想。”这个定义由来已久，似无庸置疑，但仔细想来，它似有片面之嫌。常识告诉我们：文章是表情达意的工具。这个定义只及“达意”（表达的基本思想），而不及“表情”，岂不为缺漏？或谓“达意”即“表情”？若然，岂不是说情感与思想等同？但心理学研究早已证明，情感是与思维不同的心理过程，它“具有独特的主观体验的形式和外部表现的形式”，具有极为复杂的社会内容。虽然思想左右情感，但情感也会左右思想。详而言之，在实际心理过程中，有时思想是主流，有时情感是主流，尽管二者不可割裂。美国的J.M.索里、C.W.特尔福德在《教育心理学》中指出：“当全部反应在性质上主要是情感反应时（主要是内脏的），观念性的期望与知觉的和概念的意义（主要是神经的）同样也可以成为全部反应的组成部分。”反之亦然。心理过程中思想与情感所占地位的不同，“外化”或表现为不同文体中主题类型的不同。在逻辑类文章中，是“理为主”，在形象类文章中，是“情为主”。文论上说的“辞以情发”就是指的后者情形。各种形象类或文艺类文章，旨（主题）在“表情言志”，“以情感人”（不同于逻辑类的“以理服人”）。写这类文章，是“情动于中而形于外”，发乎情——“能憎，能爱，始能文”（鲁迅），终乎情——“情尽言止”。所以，为使“主题”或“主旨”的定义更有涵盖性，定义的中心词就应是思想与情感二者，即定义为：
主题是作者在文章中通过一系列精心选择、剪裁、并编织起来的具体材料所表达的最主要的思想和倾向（倾向就是对生活现实的憎爱情感或态度）。
这样，定义对逻辑或形象类文章都适用。实际上，人们（例如语文教师）在分析、归纳一些文章的主题时，通常总是说：本文通过××（材料与表达方式），表达了作者×××的思想，抒发了作者×××的感情（有的虽不写“抒发了××之情”，但那个“主题句”却是把理、志、情融为一体，包含“情志”内容的）。可见只言“思”不言“情”的主题定义，也与“主题”这一术语在实际使用中的内涵不相吻合，而修改后的定义则可避免这一点。
将“主题”定义的中心词改成“思想与倾向”，虽只是一词之增，但由于它符合作文心理过程的实际，符合文章内容的实际，因而无论对写作实践或阅读实践，都具有重要的意义。写作，尤其是文艺创作，正如黑格尔所说：“一方面求助于常醒的理解力，另一方面也要求助于深厚的心胸和灌注生气的情感。”树立了“主题”是“最主要的思想和倾向”的深刻观念，将使习作者更自觉地用“两条腿走路”，更自觉地酝“情”发“思”，使二者相互渗透，相互激发。这就是“情感思维”。在“情感思维”中，情之所至，材料跃然，思如流水（联想和想象的纽带就是情感）。作家的经验证明：正是在情思激越时，妙笔才能生花，写出文情并茂的传世之作。即使是写逻辑类的论说文，也当如朱光潜先生所说：“也还是要动一点情感，要用一点形象思维”。如果把“主题”仅仅定义为“主要思想”，就会“暗示”人们去写所谓“零度风格”的文章。而“零度风格”的文章既不易写成，更不会打动读者（“零度风格”，zero style，参见朱光潜《漫谈说理文》）。阅读呢？固然，阅读要通过概念、判断、推理去评析，但首先要通过形象、情境和美感等去鉴赏。主题仅仅是“主要思想”的观念，会“暗示”人们将阅读的注意力投向理性分析，而忽视形象思维（不少学生形象思维能力差，与他们自小就接受的“主题就是主要思想”这个定义不无关系）。其实，阅读应当交错地运用抽象思维与形象思维，领会文中情理相生的旨趣。鉴赏文学作品，既要借助想象（与“深厚的心胸和灌注生气的情感”相关联），又要借助分析、综合和概括（与“常醒的理解力”相关联），挖掘作品的思想意义和所蕴含的哲理。这才能发挥文学的认识作用、教育作用和美感作用的整体功能。
定义的中心词何以用“倾向”而不用“情感”？这是因为“倾向”除含有“憎爱之情”外，还有“态度”、“趣向”等几个义项，即有更广的外延。文体不同，内容不同，“情感”的类型也各异。各种“思>；情”的文体（各种应用文、政论文、学术论文等），狭义的“情感”（憎爱之情）色彩并不浓，蕴含于文中的，主要是某种志向、愿望、态度或精神。而这些广义的“情感”，均可用“倾向”这一术语来指称。例如，一些学术论文，与其说内中蕴含一种“情感，勿宁说蕴含着一种“倾向”，一种执着地探索并证明真理的欲望、志向和求实精神。因为通常总是把“情感”理解为狭义的，所以用“倾向”可以使定义对各类文体都适用。
材料
常见的一个定义是：“材料是提供文章内容和表达主题的事物和观念。”严格地说，“事物”并不是材料：尚未反映到头脑中的“事物”不会是材料；已经反映到头脑中（或写入文章中）的“事物”，已是一种观念，一种关于“事物”的感性或理性的认识。这是唯物论的常识。与此相一致，人们有“文章是客观事物的反映”的正确命题：“反映”二字，不独指文章的观点，也指其中的材料。也正因为如此，人们评价文中材料时才有“真与假”、“片面与全面”等标准。如果材料的外延包含与“观念”相对的“事物”本身，那材料（事物）就没有“真假”、“偏全”等区别了。所以，材料是“事物”的说法不能成立。
另一种有影响的定义是：“材料是从生活中搜集、摄取以及写入文章中的一系列事实或论据。”这个定义含有另一种毛病。“事实或论据”，显系分指两类文体中的材料：文艺类的材料——事实，论说类的材料——论据。但是，文艺类的材料不尽是“事实”（“事实”一般总是指对事物、现象、过程的直接反映，属于感性认识），也有与“事实”相对的“理念”（指思想观点，即理性认识）。例如，文艺作品中经常穿插一些引用先哲的话语或作者关于生活哲理的直接议论等，用以支持作品的主题。这一类材料，就属于与“事实”相对的“理念”。所以，用于分指的这个定义中的“事实”，实在缺乏概括性。若定义中的“事实或论据”不是分指，而是“概指”，同样不能成立：文艺文既然非“论”，其中虽有议论，也不宜称为“论据”；至于论说文，其中的材料固可称为“论据”，但“论据”与“事实”不是同一平面上的概念，而是属种关系的概念——论据划分为事实论据和理论论据两类。处于上下位关系的两个术语（“事实”和“论据”），用“或”或“和”连接都是不妥的。
对“材料”怎样下定义才臻于严格和科学？上举定义中的“事物和观念”，本意在指出两种类型的材料：感性材料——“事物”，理性材料——“观念”。倘从这个角度下定义，并与认识论相一致，似可说：
材料是作者形成或表达特定主题所依赖和采用的一系列感性和理性认识。
或者：
材料是作者在形成或表达特定主题时摄取、使用的各种信息——感知和理念。
还应提及的是，上边这个定义中“形成或表达特定主题”这个修饰性成分绝不可省，因为它揭示了材料的自身规定性——与主题的相对性或相互依存关系。材料，总是特定主题的材料。换言之，只是在与特定主题的对立联系中，特定的“信息”（感知和理念）才称之为材料。因此，在此篇为材料者（如某种观念），在彼篇可以是主题；在此篇为主题者，也可以是另一篇另一主题的材料。这就是材料和主题的相互依存性与相对性。我们在给主题下定义时揭示了二者的这种辩证关系，指出主题是“一系列具体材料”表达出来的“最基本的思想和倾向”。这是因为没有特定具体材料的表现就没有主题。同样，在给材料下定义时，也绝不可忽略这一点。“形成或表达特定主题”——这是材料自身存在的根据，是材料的本质属性之一。
结构
常见的一种提法是：“简洁地说，结构就是文章的内部组织构造。”这个“定义”看似天经地义，其实违背逻辑。因为逻辑上的定义公式是“种差+邻近的属”，而这个定义的中心词“组织”、“构造”并不是“结构”“邻近的属”，而只是“结构”的同义词。我们不能知道“构造”比“结构”多了点什么，所以这个定义实等于说“结构，就是文章的内部结构”。可惜这个“定义”一直为一些论著所沿用。
有的书在“结构”章没说结构是什么，只指出“结构是文章的骨架”，似以此作为“结构”的定义。骨架，确实很形象地表达了结构的特征和作用，但这只是一个比喻，比喻永远不能成为定义，因为比喻永远不能直接揭示对象的类和特有的本质属性。
还有的定义是“偷换”概念。书中论及“结构”，开宗明义的就说：“结构是对文章全部内容的编织和安排。”作者要给“结构”（N，指文章要素之一）下定义，但下的却是“结构”（V，即安排结构）的定义。“结构”确有名、动两种词性，是个兼类词，但写作论著应当把“结构”（N）与“结构”（V）分开，并用“安排结构”或“布局谋篇”来代替“结构”（V），以免术语混淆。若作者说上边这个定义原是给“结构”（V）下定义，讨论“结构”（V，“联结、组合”之义）之法，以切近于指导写作实践之目的，那么，就产生另一个疑问，即，一般论著在论述其他三要素（主题、材料、语言）时，都是用的名词性术语，唯独讨论“结构”时用它的动词义，这岂不造成论著自身体系的不统一？若按这种“切近于实用”的说法，为求得体系自身统一起见，就当将主题改为“立意”，材料改为“选材”，语言改为“遣词造句”了。但这实际上已不是文章四要素，而是作文四环节了。显然，作者的本意不是这样。所以说上边这个定义是“偷换”了概念。
稍好一点的定义是：“结构是文章材料的组织方式”。“方式”是“结构”的上位概念，它揭示了“结构”属于“形式”的范畴，触及到“结构”的本质。但这个定义却失之疏漏。“结构”不仅是“材料的组织方式”，还是材料与主题的联结方式。例如，论说文的结构在很大程度上相当于论证方式，而论证方式乃是论点和论据之间的联结方式，我们不能说论说文的结构仅仅是论据之间的联结方式。固然，论说文的结构也包括了这一层，但论说文结构更重要的内涵是论点与论据之间的联结方式。所以安排论说文“结构”的构思，不只是要考虑论据之间的关系和联结问题，更要考虑全部论据与中心论点的关系和联结问题，后者乃是“布局谋篇”首先要解决的全局性问题。所以，“结构”的严格定义应当是：
结构是文章中材料与主题间以及材料间相互联结的方式。
或者：
结构是文章全部内容（主题与材料）的编排、组织形式。
或者抽象一点：
结构是文章内部组成部分相互联结的方式或构成形式。
语言
不少写作论著未给“语言”下定义，似乎认为它不是一个重要概念。或者认为：语言这个东西，人们太熟悉了，无须下什么定义。其实，熟悉的东西不定都能下一个准确的定义，而下不好定义，其实就只是表面的“熟悉”，并没有抓住对象的本质。
若干论著引用列宁的话，指出“语言是人类最重要的交际工具”。这是从社会功能上给语言下定义，树立这一观点，充分认识语言的社会本质，自然是重要的。但写作论著不能停留在这一点上。由于语言在写作学中的特殊地位（就某种意义讲，所谓写作，就是运用语言的艺术），写作学当有自己特有的“语言”定义。这种定义既要反映语言的本质属性，又应顾及写作实际，具有指导语言运用的理论内容。现代语言学对语言现象的研究日益深入，在构拟写作学的“语言”定义时，可以而且应当借鉴其中关于语言的本质、构成、习得、运用等方面的有关理论成果。
似可给“语言”下这样的定义：
语言是直接标记心理经验因而具有透义性的符号，是思想的“建筑材料”和写作的表达工具，它本身包括语音、词汇、语法三个系统，每个系统都是一个分层的装置，靠组合和替换进行运转。
写作论著中的“语言”章，对这样的定义自然要作一点解释，要介绍一点语言的理性知识。至少，应指出“语言与言语的区别”，“语言的符号性及其透义性”（其他符号要转译为语言符号才能被理解和有意义，如“红灯”，只是在社会将它转译为“禁止通行”时，“红灯”这种符号才具有了意义。语言符号则不然，它无须转译，因为它直接与思想情感相联系，是透义的符号），指出“语言习得和运用的基本手段——组合和替换”，等等。旧写作论著的“语言”章，往往只提出“语言的要求”，言必称“三性”（准确、鲜明、生动），至于怎样达到“三性”，语言”到底是什么，其基本手段若何，就不涉及了。这种封闭式的樊篱，新的写作研究应当突破。
以上分别对文章四要素的概念定义提出商榷，借以引起讨论。古人云：“一名之立，旬月踌躇”，可知给术语下定义是科研中最吃力的事情之一。由于思力所限，加之“踌躇”不够，这篇小文中的“修正意见”只能是抛砖引玉。
拟题
1.通过文章内容要素拟定标题的基该方法
拟制标题所依据的文章内容要素，主要有三个：一是文章的主题，二是文章的课题，三是文章的材料。
依据文章的主题
依据文章主题拟制标题可以分为直接和间接两种情况。
直接依据主题拟题，就是运用简洁、凝练的语句概括出文章主题，并以此作为文章标题。如光明日报评论员文章《实践是检验真理的唯一标准》，鲁迅的《辱骂和恐吓决不是战斗》，毛泽东的《反对党八股》，以及诸如《要珍惜时间》，《知识就是力量》，《勤能补拙》等，都属于这种情况。直接依据主题拟制的标题，本身就是文章主题的表述形式，它具有明快、朴实的特点，便于读者准确、迅速地把握文章主题。一般议论文和应用文较多采用这种标题形式。这种拟制标题的方法，我们可以称之为“主题法”。
间接依据主题拟题，就是通过设问或比喻、象征等手法，在标题中间接地表现和传达文章主题。间接依据主题拟题的方法主要有“设问法”和“比喻象征法”两种。所谓“设问法”，就是以提问题的形式来拟制标题，标题以疑问句的形式出现。如列宁的《怎么办》，鲁迅的《中国人失掉自信力了吗？》，魏巍的《谁是最可爱的人》，以及《承包后对“多余”的职工怎么办？》，《我们应向先进人物学什么？》等，都是用设问法拟制的标题。采用设问法拟制标题应该抓住具有普遍性、倾向性，并为广大读者所关心的问题，或是容易为人们所忽视的重要问题，这样容易造成悬念，引起人们思考和阅读的兴趣。所谓“比喻象征法”，就是采用比喻、象征的手法来拟制标题。如毛泽东的《星星之火，可以燎原》，肖凤的《豆牙菜和小松树》，鲁迅的《朝花夕拾》，秦牧的《艺海拾贝》等，都是用比喻象征法拟制的标题。这种标题形象生动，给人的印象深。拟制这种标题需要作者具有丰富的想象力和文学词汇。
间接依据主题拟制的标题，虽然并没有直接点明主题，但它与主题的关联却是十分`,
          view_counts: "",
        },
      ],
    };
  },
  methods: {
    handleDetail(index, row) {
      this.dialogTableVisible=true,
      this.nowContent=row.content
    },
    handleEdit(index, row) {
      this.$router.push({path:'/NoticeEdit',query:{type:false,id:row.id}})//type参数 true为修改 false为添加
    },
     handleAdd(index, row) {
      this.$router.push({path:'/NoticeEdit',query:{type:true}})
    },
    handleDelete(index, row) {
      axios.get("/delNotice", row.id);
    },
  },
  mounted() {
    this.$axios
      .get("/notice/getall")
      .then((response) => {
        this.noticeNum = response.pageNumber;
        this.noticeDate = response.data;
      })
      .catch((error) => {
        console.log(error);
        alert("网络错误，不能访问");
      });
  },
};
</script>

<style scoped>
.el-row {
  margin-bottom: 20px;
  height: 500px;
}
.maincontainer {
  height: 100%;
}
.leftside {
}
.rightside {
}
.el-button--success {
  margin-top: 20px;
}
</style>